app/controllers/welcome_controller.rb

  def load_url
    url_info = params[:info]
    url_info.split("<br/>").each do |url|
      UrlInfo.create(:url=>url) if UrlInfo.find_by_url(url) == nil
---
SELECT * FROM "url_infos" WHERE ("url_infos"."url" = 'www.a.com<br>') LIMIT 1
INSERT INTO "url_infos" ("url", "created_at", "updated_at") VALUES('www.a.com<br>', '2012-10-28 14:45:15', '2012-10-28 14:45:15')